import Foundation

public typealias Team = (隊伍名: String, 勝場數: Int, 敗場數: Int, 分區: String)
let teams: [Team] = [("克里夫蘭 騎士", 44, 38, "東區"), ("底特律 活塞", 23, 59, "東區"), ("紐約 尼克", 37, 45, "東區"), ("休士頓 火箭", 20, 62, "西區"), ("沙加緬度 國王", 30, 52, "西區"), ("洛杉磯 快艇", 42, 40, "西區"), ("洛杉磯 湖人", 33, 49, "西區"), ("波特蘭 拓荒者", 27, 55, "西區"), ("夏洛特 黄蜂", 43, 39, "東區"), ("達拉斯 獨行俠", 52, 30, "西區"), ("明尼蘇達 灰狼", 46, 36, "西區"), ("多倫多 暴龍", 48, 34, "東區"), ("猶他 爵士", 49, 33, "西區"), ("密爾瓦基 公鹿", 51, 31, "東區"), ("丹佛 金塊", 48, 34, "西區"), ("奧克拉荷馬城 雷霆", 24, 58, "西區"), ("費城 76人", 51, 31, "東區"), ("邁阿密 熱火", 53, 29, "東區"), ("金州 勇士", 53, 29, "西區"), ("曼菲斯 灰熊", 56, 26, "西區"), ("芝加哥 公牛", 46, 36, "東區"), ("亞特蘭大 老鷹", 43, 39, "東區"), ("印第安納 溜馬", 25, 57, "東區"), ("鳳凰城 太陽", 64, 18, "西區"), ("紐奧良 鵜鶘", 36, 46, "西區"), ("布魯克林 籃網", 44, 38, "東區"), ("華盛頓 巫師", 35, 47, "東區"), ("奧蘭多 魔術", 22, 60, "東區"), ("聖安東尼奧 馬刺", 34, 48, "西區"), ("波士頓 塞爾蒂克", 51, 31, "東區")]

public func getTeamRecords() -> [Team] { teams }
